app/controllers/contractors_controller.rb

	def index
		@contractors = Contractor.all
---
SELECT `contractors`.* FROM `contractors`

	def create
		@contractor = Contractor.new(params[:contractor])
		@contractor.save
---
INSERT INTO `contractors` (`contractor_id`, `created_at`, `first_name`, `last_name`, `updated_at`) VALUES (NULL, '2013-03-05 01:09:33', 'Thomas', 'S', '2013-03-05 01:09:33')